// стрелки по умолчанию true
arrows: false,
// точки по умолчанию false
dots: true,
// автоматическая адаптивная высота слайда
adaptiveHeight: true, /* по умолчанию false без css не будет работать*/
// указываем количество слайдов которое хотим отобразить сразу по умолчанию 1
slidesToShow:1,
// указываем количество слайдов которые будут пролистываться за одно нажатие по умолчанию 1
slidesToScroll: 1,
// скорость пролистывание по умолчанию 300 милисекунд
speed: 2000,
// опция отвечает за тип анимации при смене нашего слайда по умолчанию линия
easing: 'linear',
// делает слайдер безконечным по умолчанию true
infinite: true,
// опция стартового слайда по умолчанию 0
initialSlide: 0,
// автоматическое проигрование слайда по умолчанию выключено
autoplay: true,
// скорость проигрование слайдов по умолчанию 3000
autoplaySpeed: 2000,
// дополнительные опции к прокрутке всего 3шт фокус по умолчанию true
pauseOnFocus: true,
pauseOnHover: true, /* по умолчанию true */
pauseOnDotsHover: true,/* по умолчанию true */
// опция которая не дает мышкой листать слайд на пк  по умолчанию true
draggable: true,
// опция которая не дает мышкой листать слайд на планшетах и мобилках  по умолчанию true
swipe: true,
// опция отвечает за момент срабатывания слайда при свайпе по умолчанию 5
touchThreshold: 10,
// опция вклучает все возможности слайдера  по умолчанию true
touchMove: true,
// если клацаем по стрелочки быстро увеличивается скорость прокрутки по умолчанию true
waitForAnimate: true,
// по умолчанию false cлайд номер 1 выстраивается по центру всегда добовляется новый класс center
centerMode: false,
// по умолчанию false убирает ширину между слайдами хорошо работает  с  centerMode
variableWidth: false,
// по умолчанию 1 опция делает ряды
rows: 1,
// по умолчанию 1 делает колонки
slidesPerRow: 1,
// вертикальный слайд по умолчанию false
vertical: false,
// свайпает вертикально по умолчанию false
verticalSwiping: false,
// красивое слайд шоу только 1 картинка и меняется плавно по умолчанию false
fade:false